%% 第一问
moorsys(2,22.05,1200,18,12,0,1);
moorsys(2,22.05,1200,18,24,0,1);
%% 第二问
moorsys(2,22.05,1200,18,36,0,1)
%%
% 调节重球质量 获得角度与重物球之间的关系
phi_t = [];
phi_j = [];
m = 1000:3000;
for mz=1000:3000
   [phi,f,h] = moorsys(2,22.05,mz,18,36,0,0);
   phi_t = [phi_t,phi(6)];
   phi_j = [phi_j,90-phi(216)];
end
plot(m,phi_t);
hold on
plot(m,phi_j);
h1 = refline(0,5);
h2 = refline(0,16);
set(h1,'color','black');
set(h2,'color','black');
legend('钢桶倾斜角','锚链与海床夹角');

% 观察图案可以得到一个大致的值在2233左右

%%
% 调节重球质量 获得吃水深度与重物球之间的关系

h_s = [];
m = 6100:0.05:6150;
for mz=6100:0.05:6150
   [phi,f,h] = moorsys(2,22.05,mz,18,36,0,0);
   h_s = [h_s,h];
end
plot(m,h_s);

% 观察此图，吃水深度与重物球质量呈正相关

%%
for m = 4000:1:5000
    [phi,f,h] = moorsys(2,22.05,m,18,36,0,0);
    if h>2
        m
        break;
    end
end


%%
%测算m下界的值
for m = 2200:0.05:2300
    [phi,f,h] = moorsys(2,22.05,m,18,36,0,0);
    if 90-phi(216)<16
        m
        break;
    end
end

%% 第三问
m = 2000:3000;
l = 20:30;
z_f =zeros(length(l),length(m))
z_h =zeros(length(l),length(m))
for m1 = 2000:3000
    for l1 = 20:30
        [~,f,h]=moorsys(2,l1,m1,18,36,1.5,0);
        z_f(l1,m1) = f;
        z_h(l1,m1) = h
    end
end 
%% 第三问
moorsys(5,21.40,4812,16,36,1.5,1);
moorsys(5,21.40,4812,18,36,1.5,1);
moorsys(5,21.40,4812,20,36,1.5,1);

钢桶的倾斜角是4.96322 °,浮标的吃水深度为1.786369 m
四个钢管的倾斜角分别是4.586576 °,4.645660 °,4.704930°,4.764385°
沉底的锚链长度为0.7200 m, 自由游动区域半径18.901919 m
钢桶的倾斜角是4.85071 °,浮标的吃水深度为1.807610 m
四个钢管的倾斜角分别是4.480216 °,4.538308 °,4.596580°,4.655032°
沉底的锚链长度为0.0000 m, 自由游动区域半径17.908866 m
钢桶的倾斜角是4.72101 °,浮标的吃水深度为1.832863 m
四个钢管的倾斜角分别是4.357586 °,4.414540 °,4.471667°,4.528968°
沉底的锚链长度为0.0000 m, 自由游动区域半径16.638376 m
